src/Documents/ИС_Ozon_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Ozon_Заказ</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivery_type</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>tpl_provider</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivering_date</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lower_barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>upper_barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_multibox</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>multi_box_qty</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>order_number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>address_tail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customer_email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>delivery_method_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipment_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>order_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>tracking_number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>is_express</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказФБО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>products</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураOzon</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаOzon</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Ozon_Штрихкоды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_gtd</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_country</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_mandatory_mark</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>requiring_rnpt</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СтатусыСборочныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СтатусыСборочныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_СтатусыОтправлений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>substatus</Name>
					<Comment>ИнфоСофт Прокопцов Д. И. 03.03.2025 УА #93657</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_ДетальныеСтатусыОтправлений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>posting_number</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>shipment_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>recommended_shipment_date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>cancelled_after_ship</Name>
					<Comment>ИнфоСофт Прокопцов Д. И. 04.03.2025 УА #93657</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_Ozon_Заказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_Ozon_СтатусыОтправлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_Ozon_СтатусыОтправлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>acceptance_in_progress</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>arbitration</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>awaiting_approve</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>awaiting_deliver</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>awaiting_packaging</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>awaiting_registration</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>awaiting_verification</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>cancelled</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>cancelled_from_split_pending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>client_arbitration</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>delivered</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>delivering</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>driver_pickup</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>not_accepted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>sent_by_seller</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИС_Ozon_Заказ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 

//+ ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого Элемент Из Объект.products Цикл
		Элемент.Отправление = 1;
	КонецЦикла;
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	Если Объект.ЗаказФБО Тогда
		Элементы.productsРазделитьТоварНаОтправления.Доступность = Ложь;
		Элементы.СписокСобратьЗаказ.Доступность = Ложь;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989
&НаКлиенте
Процедура РазделитьТоварНаОтправления(Команда)
	
	ТекущаяСтрока = Элементы.products.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Для выполнения команды требуется выбрать строку табличной части.'");
		ПоказатьПредупреждение( , ТекстСообщения);
	Иначе
		
		ТекущаяСтрока = Элементы.products.ТекущиеДанные;
		
		Если ТекущаяСтрока.quantity < 1 Тогда
			ТекстСообщения = НСтр("ru = 'Невозможно разбить строку с количеством меньше двух.'");
			ПоказатьПредупреждение( , ТекстСообщения);
			Возврат;
		КонецЕсли;
		
		Заголовок 	= НСтр("ru = 'Введите количество товара в новой строке'");
		Оповещение 	= Новый ОписаниеОповещения("РазделитьТоварНаОтправленияНаСервере", ЭтотОбъект);
		ПоказатьВводЧисла(Оповещение, 1, Заголовок, 10, 0);
		
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989

//+ ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989
&НаКлиенте
Процедура СобратьЗаказ(Команда)
	СобратьЗаказНаСервере();
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989
&НаКлиенте
Процедура РазделитьТоварНаОтправленияНаСервере(Количество, СтруктураПараметров) Экспорт
	
	ТекущаяСтрока = Элементы.products.ТекущиеДанные;
	Если Количество = Неопределено Тогда
		Возврат;
	ИначеЕсли Количество = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть равно нулю.'");
		ПоказатьПредупреждение( , ТекстСообщения);
		Возврат;
	ИначеЕсли Количество < 0 Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть отрицательным.'");
		ПоказатьПредупреждение( , ТекстСообщения);
		Возврат;
	ИначеЕсли Количество > ТекущаяСтрока.quantity Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке не может быть больше количества в текущей.'");
		ПоказатьПредупреждение( , ТекстСообщения);
		Возврат;
	ИначеЕсли Количество = ТекущаяСтрока.quantity Тогда
		ТекстСообщения = НСтр("ru = 'Количество в новой строке должно отличаться от количества в текущей.'");
		ПоказатьПредупреждение( , ТекстСообщения);
		Возврат;
	КонецЕсли;

	ИндексТекущейСтроки 	 = Объект.products.Индекс(ТекущаяСтрока);
	НоваяСтрока 			 = Объект.products.Вставить(ИндексТекущейСтроки + 1);
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);

	НоваяСтрока.quantity   		= Количество;
	НоваяСтрока.Сумма   		= НоваяСтрока.quantity * НоваяСтрока.price;
	НоваяСтрока.Отправление		= ТекущаяСтрока.Отправление + 1;
	ТекущаяСтрока.quantity 		= ТекущаяСтрока.quantity - НоваяСтрока.quantity;
	ТекущаяСтрока.Сумма 		= ТекущаяСтрока.Сумма - НоваяСтрока.Сумма;

	Элементы.products.ТекущаяСтрока  = НоваяСтрока.ПолучитьИдентификатор();
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989

//+ ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989
&НаСервере
Процедура СобратьЗаказНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.status КАК status	
		|ИЗ
		|	Документ.ИС_Ozon_Заказ КАК ИС_Ozon_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СтатусыСборочныхЗаданий КАК ИС_Ozon_СтатусыСборочныхЗаданий
		|		ПО ИС_Ozon_Заказ.Ссылка = ИС_Ozon_СтатусыСборочныхЗаданий.Заказ
		|ГДЕ
		|	ИС_Ozon_СтатусыСборочныхЗаданий.Заказ = &Заказ
		|	И ИС_Ozon_Заказ.Ссылка = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивЗаданий = РезультатЗапроса.Выгрузить();
	
	МассивОтправлений = Новый Массив;
	
	Если МассивЗаданий[0].status = Перечисления.ИС_Ozon_СтатусыОтправлений.awaiting_packaging Тогда	 
		
		Объект.products.Сортировать("Отправление");
		Тело = Новый Структура;
		Упаковки = Новый Массив;
		СоставОтправлений = Новый Массив;
		НомерОтправления = Объект.products[0].Отправление;
		
		Для Каждого Элемент Из Объект.products Цикл 
			
			Состав = Новый Структура;
			//+ ИнфоСофт Мурсалимов Д.Р. 26.02.24 УА #71286
			Состав.Вставить("product_id", Число(Элемент.НоменклатураOzon.sku));
			//Состав.Вставить("product_id", Число(Элемент.НоменклатураOzon.Код));
			//- ИнфоСофт Мурсалимов Д.Р. 26.02.24 УА #71286
			Состав.Вставить("quantity", Элемент.quantity);   
			
			Если НомерОтправления <> Элемент.Отправление Тогда 
								
				products = Новый Структура;
				products.Вставить("products", СоставОтправлений); 
				Упаковки.Добавить(products);
				СоставОтправлений = Новый Массив;  
				СоставОтправлений.Добавить(Состав);
				
				НомерОтправления = Элемент.Отправление;   
				
			Иначе
				СоставОтправлений.Добавить(Состав);				
			КонецЕсли;
			
		КонецЦикла;
		
		products = Новый Структура;
		products.Вставить("products", СоставОтправлений); 
		Упаковки.Добавить(products);
		
		Тело.Вставить("packages", Упаковки);
		Тело.Вставить("posting_number", Объект.Номер);
		
		Результат = ИС_Ozon_Сервер.РазбитьНаОтправления(Объект.Профиль, Тело);
		
		Если Результат Тогда
			
			Если ЗначениеЗаполнено(Объект.Заказ)Тогда
				//+ ИнфоСофт Заварин К.В. 25.09.24 УА #73468
				//ИС_Ozon_Сервер.ОтменитьЗаказ(Объект.Ссылка, Объект.Профиль);
				ИС_Ozon_Сервер.ОтменитьЗаказ(Объект.Ссылка, Объект.Профиль, Ложь);
				//- ИнфоСофт Заварин К.В. 25.09.24 УА #73468
				Объект.Заказ = Документы.ЗаказКлиента.ПустаяСсылка();
			КонецЕсли;
			
			ЭтотОбъект.Записать();
			ИС_Ozon_Сервер.ПолучитьЗаказы(Объект.Профиль, Объект.Дата - 1);
			ЭтотОбъект.Прочитать();
			
		КонецЕсли;
				
	КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.08.2023 УА #60989

#КонецОбласти
